var chart = c3.generate({
    animationEnabled: true,
    data: {
        columns: [
            ['แนะนำเซต',0,0,0,0,20],
            ['วิธีการเขียนเซต', 5],
            ['เอกภพสัมพัทธ์', 7],
            ['เซตจำกัดและเซตอนัน', 6],
            ['การเท่ากันของเซต', 4],
            ['แบบทดสอบ', 80]
        ],
        axes: {
            แบบทดสอบ: 'y2'
        },
        type:'bar',
        types: {
            แบบทดสอบ: 'spline'
        }
    },

    axis: {
        x: {
            label: 'วันที่',
            type: 'category',
            categories: ["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30"],
            tick: {
                rotate: 0
            }
        },
        y: {
            label: 'เวลา (นาที)',
            position: 'outer-middle',
        },
        y2: {
            show: true,
            label: 'คะแนนสอบ (คะแนน)'
        }
    }

});
