var chart2 = c3.generate({
    animationEnabled: true,
    data: {
        columns: [
            ['แนะนำเซต',0,0,0,0,20,0,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            ['วิธีการเขียนเซต',0,0,0,0,0,0, 5,0,0,0,0,14,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            ['เอกภพสัมพัทธ์',0,0,0,0,0,0,0,0,0,0, 7,0,0,12,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            ['เซตจำกัดและเซตอนัน',0,0,0,0,0,0,0,0,0,0,0,11, 6,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            ['การเท่ากันของเซต',0,0,0,0,0,0,0,0,0,0,0, 4,0,14,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            ['แบบทดสอบ',0,0,0,0,0,0,0,0,0,0,0,0,0,0,80,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0,0]
        ],
        axes: {
            แบบทดสอบ: 'y2'
        },
        type:'bar',
        types: {
            แบบทดสอบ: 'spline'
        }
    },

    axis: {
        x: {
            label: 'วันที่',
            type: 'category',
            categories: ["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],
            tick: {
                rotate: 0
            }
        },
        y: {
            label: 'เวลา (นาที)',
            position: 'outer-middle',
        },
        y2: {
            show: true,
            label: 'คะแนนสอบ (คะแนน)'
        }
    },
    tooltip: {
      format: {
         title: function (x) { return "วันที่ "+(parseInt(x)+1)}
        }   
    }


});
