var chart = c3.generate({
    animationEnabled: true,
    data: {
        x:'x',
        columns: [
            ['x','นางสาวธัญวรัตม์ อยู่วนิชชานนท์ | 50011'],
            ['แนะนำเซต', 20],
            ['วิธีการเขียนเซต', 5],
            ['เอกภพสัมพัทธ์', 7],
            ['เซตจำกัดและเซตอนัน', 6],
            ['การเท่ากันของเซต', 4],
            ['แบบทดสอบ', 80]
        ],
        axes: {
            แบบทดสอบ: 'y2'
        },
        type:'bar',
        types: {
            แบบทดสอบ: 'spline'
        }
    },

    axis: {
        x: {
            label: 'ชื่อนักเรียน',
            type: 'category',
            categories: ["แนะนำเซต","วิธีการเขียนเซต","เอกภพสัมพัทธ์","เซตจำกัดและเซตอนัน","การเท่ากันของเซต","แบบทดสอบ"],
            tick: {
                rotate: 0
            }
        },
        y: {
            label: 'เวลา (นาที)',
            position: 'outer-middle',
        },
        y2: {
            show: true,
            label: 'คะแนนสอบ (คะแนน)'
        }
    }

});
